# В большой текстовой строке подсчитать количество встречаемых
# слов и вернуть 10 самых частых. Не учитывать знаки препинания
# и регистр символов. За основу возьмите любую статью
# из википедии или из документации к языку

my_str = ("Николай Иванович Лобачевский"
          "Николай Иванович Лобачевский (20 ноября (1 декабря) 1792, Нижний Новгород — 12 (24) февраля 1856, Казань) — русский математик, один из первооткрывателей неевклидовой («гиперболической») геометрии, деятель университетского образования и народного просвещения. "
          "Лобачевский впервые детально исследовал (в современной терминологии) неевклидов мир отрицательной кривизны, подробно описал его необычные геометрические, тригонометрические и аналитические свойства и публично предложил придать ему легальный статус. Он опередил своё время и до конца жизни остался непонятым, лишь в 1870-е годы пришла всемирная слава, сделавшая Лобачевского первым в ряду великих русских математиков XIX века. Английский математик Уильям Клиффорд назвал Лобачевского «Коперником геометрии». Новаторский подход Лобачевского проторил дорогу таким фундаментальным идеям в математике, как риманова геометрия, «Эрлангенская программа» Феликса Клейна и общая теория аксиоматических систем. "
          "Лобачевский в течение 40 лет преподавал в Императорском Казанском университете, в том числе 19 лет руководил им в должности ректора; его активность и умелое руководство вывели университет в число передовых российских учебных заведений. По выражению Н. П. Загоскина, Лобачевский был «великим строителем» Казанского университета.")
my_dict = {}

my_str = my_str.lower().split()
my_str_new = [''.join(filter(str.isalpha, a)) for a in my_str]

while '' in my_str_new:
    my_str_new.remove('')

for word in my_str_new:
    my_dict.setdefault(word, my_str_new.count(word))

num = 1
while num <= 10:
    num += 1
    max_key = max(my_dict,  key=my_dict.get)
    print(f'{max_key:>5}  =  {my_dict[max_key]}')
    my_dict.pop(max_key)

print(my_str_new)
print(my_str)
