# Задача 12:
# Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница.
# Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать.
# Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.

s = int(input('Введите сумму чисел: '))
p = int(input('Введите произведение чисел: '))
a = 0
# if s > 2000 or p > 1000000:
#     print ('Вы ввели не корректные данные!')
# else:
for i in range(s):
    for y in range(s):
        if i + y == s and i * y == p:
            a += 1
            print(i, y)
else:
    print('Что то пошло не так!')
